DataProcessors/упЗагрузкаДанныхИзФайлаТахографа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упЗагрузкаДанныхИзФайлаТахографа</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/упПеревозчикПоРейсу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПеревозчикПоРейсу</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упСтатусыРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСтатусыРейсов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыРейса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненЧастично</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложенаЧастьРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упФактическиеПараметрыРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упФактическиеПараметрыРейса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоГрузовыхМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НулевойПробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пробег</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнкассации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасстояниеПоДаннымТрекеров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПлановыеПараметрыРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПлановыеПараметрыРейса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОтдыхаВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоГрузовыхМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НулевойПробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Comment>Оценочная стоимость груза</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемоеКоличествоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеНачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеОкончаниеВыполненияИсходное</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнкассации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упТахографДанныеОДеятельностиВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упТахографДанныеОДеятельностиВодителей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СлотСчитывающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТахографСлотыСчитывающегоУстройства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТахографСтатусыУправления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоложениеКарточки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТахографПоложенияКарточкиВСчитывающемУстройстве</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТахографРежимыДеятельностиВодителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упСтатусыРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыРейса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПланированиюТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформированыЗаявкиНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначеноТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/упЗагрузкаДанныхИзФайлаТахографа/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура - Загружает данные из файла, по возможности сопоставляя сотрудника, карту тахографа и рейс.
//
// Параметры:
//  ПараметрыВызоваСервера	 - Структура - параметры
//  АдресХранилища			 - Строка - Адрес временного хранилища, куда поместили файл
//
Процедура ЗагрузитьДанныеИзФайла(ПараметрыВызоваСервера, АдресХранилища) Экспорт
	
	ИмяВременногоФайла 	= ПараметрыВызоваСервера.ИмяВременногоФайла;
	
	ДвоичныеДанные 		= Новый ДвоичныеДанные(ИмяВременногоФайла);
	сткДанныеТахографа 	= упСервисныеФункции.РасшифроватьФайлТахографа(ДвоичныеДанные);
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("ТекстОшибки", "");
	сткРезультат.Вставить("Сотрудник", 		Справочники.упСотрудники.ПустаяСсылка());
	сткРезультат.Вставить("КартаТахографа", Справочники.упКартыТахографа.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(сткДанныеТахографа.ТекстОшибки) Тогда
		
		ТаблицаАктивностей = сткДанныеТахографа.ТаблицаАктивностей;
		ТаблицаАктивностей.Колонки.Добавить("Сотрудник", 	Новый ОписаниеТипов("СправочникСсылка.упСотрудники"));
		ТаблицаАктивностей.Колонки.Добавить("Флаг", 		Новый ОписаниеТипов("Булево"));
		
		// Сотрудник
		сткДанныеСотрудника = СотрудникПоНомеруКарты(сткДанныеТахографа.ДанныеИдентификации.НомерКарты);
		Сотрудник 		= сткДанныеСотрудника.Сотрудник;
		КартаТахографа 	= сткДанныеСотрудника.КартаТахографа;
								
		Для каждого СтрокаАктивности Из ТаблицаАктивностей Цикл
			
			Если ЗначениеЗаполнено(Сотрудник) Тогда
				СтрокаАктивности.Сотрудник 	= Сотрудник;
			КонецЕсли;	
			СтрокаАктивности.Период		= МестноеВремя(СтрокаАктивности.Период, ЧасовойПоясСеанса());
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Сотрудник) Тогда
			тбзАктивностей		  = ПодобратьРейсы(ТаблицаАктивностей);			
			мсвТаблицаАктивностей = ОбщегоНазначения.ТаблицаЗначенийВМассив(тбзАктивностей);
		Иначе
			мсвТаблицаАктивностей = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаАктивностей);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
			Сотрудник = СотрудникПоФамилииИмени(сткДанныеТахографа.ДанныеИдентификации.ФамилияВодителя, сткДанныеТахографа.ДанныеИдентификации.ИмяВодителя); 
			сткРезультат.Сотрудник = Сотрудник;
		КонецЕсли;
		
		сткРезультат.Вставить("ДанныеИдентификации", 	сткДанныеТахографа.ДанныеИдентификации);
		сткРезультат.Вставить("ТаблицаАктивностей", 	мсвТаблицаАктивностей);
		сткРезультат.Вставить("Сотрудник",				Сотрудник);
		сткРезультат.Вставить("КартаТахографа",			КартаТахографа);
	Иначе
		ТекстСообщения = Нстр("ru = 'При загрузке произошла ошибка:%1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, сткДанныеТахографа.ТекстОшибки);
		сткРезультат.Вставить("ТекстОшибки", ТекстСообщения);
	КонецЕсли;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(сткРезультат, АдресХранилища);
	
КонецПроцедуры

// Функция - Поиск сотрудник по фамилии имени, значения могут быть заданы как на кириллице, так и транслитом.
//
// Параметры:
//  Фамилия	 - Строка	 - фамилия.
//  Имя		 - Строка	 - имя.
// 
// Возвращаемое значение:
//  Справочник.упСотрудники - ссылка на сотрудника, в случае удачного поиска.
//
Функция СотрудникПоФамилииИмени(Фамилия, Имя) Экспорт
	
	Результат = Справочники.упСотрудники.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упСотрудники.Ссылка
	               |ИЗ
	               |	Справочник.упСотрудники КАК упСотрудники
	               |ГДЕ
	               |	упСотрудники.Наименование ПОДОБНО &НаименованиеЛатиница
	               |	И НЕ упСотрудники.ПометкаУдаления";
	
	ФамилияИмя = СокрЛП(Фамилия) + " " + СокрЛП(Имя);
	СтрокаДляПоискаЛатиница = "%" + ФамилияИмя + "%";
	
	// Сначала проверяется латиница	
	Запрос.УстановитьПараметр("НаименованиеЛатиница", СтрокаДляПоискаЛатиница);
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(ФамилияИмя,," ") Тогда
		
		СтрокаДляПоискаКириллица = упСервисныеФункцииКлиентСервер.СтрокаКириллицей(ФамилияИмя);
			
		Если НЕ ПустаяСтрока(СтрокаДляПоискаКириллица) Тогда
			
			СтрокаДляПоискаКириллица = "%" + СтрокаДляПоискаКириллица + "%";
			
			Запрос.Текст = Запрос.Текст +"
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
			Запрос.Текст = Запрос.Текст +"ВЫБРАТЬ
			                             |	упСотрудники.Ссылка
			                             |ИЗ
			                             |	Справочник.упСотрудники КАК упСотрудники
			                             |ГДЕ
			                             |	упСотрудники.Наименование ПОДОБНО &НаименованиеКириллица
			                             |	И НЕ упСотрудники.ПометкаУдаления";
			
			Запрос.УстановитьПараметр("НаименованиеКириллица", СтрокаДляПоискаКириллица);
			
		КонецЕсли;
	КонецЕсли;
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Функция - Заполняет колонку рейс в таблице, подбирается не отмененный рейс по сотруднику с максимальной датой
//           фактического выполнения, которая меньше периода записи таблицы.
//
// Параметры:
//  ТаблицаАктивностей	 - ТаблицаЗначений - таблица активностей
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с заполненными рейсами
//
Функция ПодобратьРейсы(ТаблицаАктивностей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	втТаблицаАктивностей.Период,
	               |	втТаблицаАктивностей.Сотрудник,
	               |	втТаблицаАктивностей.СлотСчитывающегоУстройства,
	               |	втТаблицаАктивностей.СтатусУправления,
	               |	втТаблицаАктивностей.ПоложениеКарточки,
	               |	втТаблицаАктивностей.Флаг,
	               |	втТаблицаАктивностей.РежимДеятельности
	               |ПОМЕСТИТЬ втТаблицаАктивностей
	               |ИЗ
	               |	&тбТаблицаАктивностей КАК втТаблицаАктивностей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблицаАктивностей.Период,
	               |	втТаблицаАктивностей.Сотрудник,
	               |	МАКСИМУМ(упПеревозчикПоРейсуСрезПоследних.Рейс) КАК Рейс
	               |ПОМЕСТИТЬ втРейсы
	               |ИЗ
	               |	втТаблицаАктивностей КАК втТаблицаАктивностей
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упПеревозчикПоРейсу.СрезПоследних КАК упПеревозчикПоРейсуСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упСтатусыРейсов.СрезПоследних КАК упСтатусыРейсовСрезПоследних
	               |			ПО упПеревозчикПоРейсуСрезПоследних.Рейс = упСтатусыРейсовСрезПоследних.Документ
	               |				И (упСтатусыРейсовСрезПоследних.Статус В (&СписокСтатусов))
	               |		ПО (НЕ втТаблицаАктивностей.Сотрудник = ЗНАЧЕНИЕ(Справочник.упСотрудники.ПустаяСсылка))
	               |			И (втТаблицаАктивностей.Сотрудник = упПеревозчикПоРейсуСрезПоследних.Водитель1
	               |				ИЛИ втТаблицаАктивностей.Сотрудник = упПеревозчикПоРейсуСрезПоследних.Водитель2
	               |				ИЛИ втТаблицаАктивностей.Сотрудник = упПеревозчикПоРейсуСрезПоследних.Экспедитор)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упФактическиеПараметрыРейса КАК упФактическиеПараметрыРейса
	               |		ПО (упПеревозчикПоРейсуСрезПоследних.Рейс = упФактическиеПараметрыРейса.Рейс)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПлановыеПараметрыРейса КАК упПлановыеПараметрыРейса
	               |		ПО (упПеревозчикПоРейсуСрезПоследних.Рейс = упПлановыеПараметрыРейса.Рейс)
	               |ГДЕ
	               |	ЕСТЬNULL(упФактическиеПараметрыРейса.НачалоВыполнения, ЕСТЬNULL(упПлановыеПараметрыРейса.ПлановоеНачалоВыполнения, ДАТАВРЕМЯ(1, 1, 1))) <= втТаблицаАктивностей.Период
	               |	И ВЫБОР
	               |			КОГДА упФактическиеПараметрыРейса.ОкончаниеВыполнения ЕСТЬ NULL
	               |				ТОГДА втТаблицаАктивностей.Период <= ЕСТЬNULL(упПлановыеПараметрыРейса.ПлановоеОкончаниеВыполнения, ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59))
	               |			КОГДА упФактическиеПараметрыРейса.ОкончаниеВыполнения = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА втТаблицаАктивностей.Период <= ДОБАВИТЬКДАТЕ(упФактическиеПараметрыРейса.НачалоВыполнения, СЕКУНДА, РАЗНОСТЬДАТ(ЕСТЬNULL(упПлановыеПараметрыРейса.ПлановоеНачалоВыполнения, ДАТАВРЕМЯ(1, 1, 1)), ЕСТЬNULL(упПлановыеПараметрыРейса.ПлановоеОкончаниеВыполнения, ДАТАВРЕМЯ(1, 1, 1)), СЕКУНДА))
	               |			ИНАЧЕ втТаблицаАктивностей.Период <= упФактическиеПараметрыРейса.ОкончаниеВыполнения
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втТаблицаАктивностей.Период,
	               |	втТаблицаАктивностей.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблицаАктивностей.Период,
	               |	втТаблицаАктивностей.Сотрудник,
	               |	втТаблицаАктивностей.СлотСчитывающегоУстройства,
	               |	втТаблицаАктивностей.СтатусУправления,
	               |	втТаблицаАктивностей.ПоложениеКарточки,
	               |	втТаблицаАктивностей.РежимДеятельности,
	               |	втРейсы.Рейс,
	               |	упТахографДанныеОДеятельностиВодителей.РежимДеятельности ЕСТЬ NULL КАК Флаг
	               |ИЗ
	               |	втТаблицаАктивностей КАК втТаблицаАктивностей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	               |		ПО втТаблицаАктивностей.Период = втРейсы.Период
	               |			И втТаблицаАктивностей.Сотрудник = втРейсы.Сотрудник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упТахографДанныеОДеятельностиВодителей КАК упТахографДанныеОДеятельностиВодителей
	               |		ПО втТаблицаАктивностей.Период = упТахографДанныеОДеятельностиВодителей.Период
	               |			И втТаблицаАктивностей.Сотрудник = упТахографДанныеОДеятельностиВодителей.Водитель";
	Запрос.УстановитьПараметр("тбТаблицаАктивностей", ТаблицаАктивностей);
	мсвСтатусов = Новый Массив;
	мсвСтатусов.Добавить(Перечисления.упСтатусыРейса.КВыполнению);
	мсвСтатусов.Добавить(Перечисления.упСтатусыРейса.Выполнен);
	мсвСтатусов.Добавить(Перечисления.упСтатусыРейса.Выполняется);
	мсвСтатусов.Добавить(Перечисления.упСтатусыРейса.Завершен);
	мсвСтатусов.Добавить(Перечисления.упСтатусыРейса.ВыполненЧастично);
	
	Запрос.УстановитьПараметр("СписокСтатусов", мсвСтатусов);
	Возврат Запрос.Выполнить().Выгрузить();		
КонецФункции

// Функция - Сформировать карту тахографа по сотруднику.
//
// Параметры:
//  сткПараметрыКарты	 - Структура - параметры карты из файла.
//  Сотрудник			 - СправочникСсылка.упСотрудники - сотрудник.
//  ТекстОшибки			 - Строка - текст ошибки в случае неудачи.
//  Отказ				 - Булево - Истина в случае ошибки.
// 
// Возвращаемое значение:
//   СправочникСсылка.упКартыТахографа - ссылка на карту соответствующую заданным параметрам.
//
Функция СформироватьКартуТахографаПоСотруднику(сткПараметрыКарты, Сотрудник, ТекстОшибки, Отказ) Экспорт
	
	Результат = Справочники.упКартыТахографа.ПустаяСсылка();
	
	НомерКарты 	= "";
	
	Отказ 		= Ложь;
	Если НЕ сткПараметрыКарты.Свойство("НомерКарты", НомерКарты) Тогда
		Отказ = Истина;
		ТекстОшибки = Нстр("ru = 'Не задан номер карты'");
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	упКартыТахографа.Ссылка
		|ИЗ
		|	Справочник.упКартыТахографа КАК упКартыТахографа
		|ГДЕ
		|	упКартыТахографа.Код = &Код";
		Запрос.УстановитьПараметр("Код", НомерКарты);
		Выборка	= Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КартаТахографа = Выборка.Ссылка;		
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(КартаТахографа) Тогда
			КартаТахографаОбъект = КартаТахографа.ПолучитьОбъект();
			ТекстСообщения = Нстр("ru = 'Карта тахографа с номером %1 по сотруднику %2 обновлена'");
		Иначе	
			КартаТахографаОбъект = Справочники.упКартыТахографа.СоздатьЭлемент();	
			ТекстСообщения = Нстр("ru = 'Добвалена карта тахографа с номером %1 по сотруднику %2.'");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(КартаТахографаОбъект, сткПараметрыКарты);
		КартаТахографаОбъект.Код 			= НомерКарты;
		КартаТахографаОбъект.Сотрудник	= Сотрудник; 	
		КартаТахографаОбъект.Имя			= сткПараметрыКарты.ИмяВодителя; 	
		КартаТахографаОбъект.Фамилия		= сткПараметрыКарты.ФамилияВодителя; 	
		
		Попытка
			КартаТахографаОбъект.Записать();
			Результат = КартаТахографаОбъект.Ссылка;
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ТекстОшибки = ОписаниеОшибки();
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, КартаТахографаОбъект,,,Отказ);
			ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, ,КартаТахографаОбъект, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		КонецПопытки;

		Если НЕ Отказ Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомерКарты, Сотрудник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Результат);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура - Записать данные активности в регистр
//
// Параметры:
//  ТаблицаАктивностей	 - ТаблицаЗначений - заполненная таблица активностей по сотруднику.
//  ТекстСообщения		 - Строка - текст ошибки в случае неудачи.
//  Отказ				 - Булево - Истина в случае ошибки.
//
Процедура ЗаписатьДанныеАктивностиВРегистр(ТаблицаАктивностей, ТекстСообщения, Отказ) Экспорт
	
	СобытиеНачало	= Нстр("ru = 'ЗагрузкаИзТахографа.Начало'");
	СобытиеКонец 	= Нстр("ru = 'ЗагрузкаИзТахографа.Конец'");
		
	Этап	= Нстр("ru = 'Загружаются/изменяются записи данных тахографа'");
	ЗаписьЖурналаРегистрации(СобытиеНачало, УровеньЖурналаРегистрации.Информация,,, Этап);	
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	КоличествоЗаписей = 0;					
	
	мсвСтрокиТаблицы = ТаблицаАктивностей.НайтиСтроки(Новый Структура("Флаг",Истина));
	
	Для каждого Строка Из мсвСтрокиТаблицы Цикл
		
		Запись	= РегистрыСведений.упТахографДанныеОДеятельностиВодителей.СоздатьМенеджерЗаписи();
		Запись.Водитель	= Строка.Сотрудник;
		Запись.Период	= Строка.Период;
		ЗаполнитьЗначенияСвойств(Запись, Строка,,"Период");
						
		Попытка
			Запись.Записать(Истина);
			КоличествоЗаписей = КоличествоЗаписей + 1;
		Исключение
			Отказ = Истина;
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ТекстОшибки = ОписаниеОшибки();
			КонецЕсли;
			
			ТекстСообщения = Нстр("ru = 'Ошибка:%1; Запись по водителю:%2'");	
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстОшибки, Строка.Сотрудник);
			
			ЗаписьЖурналаРегистрации("Загрузка данных из тахографа", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
			Прервать;
		КонецПопытки;
	КонецЦикла;
		
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Комментарий = Нстр("ru = 'Загружено %1 записей'");	
	Комментарий = СтрШаблон(Комментарий, КоличествоЗаписей);
	ЗаписьЖурналаРегистрации(СобытиеКонец, УровеньЖурналаРегистрации.Информация,,, Комментарий);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункции

Функция СотрудникПоНомеруКарты(НомерКарты)
	
	сткРезультат = Новый Структура("КартаТахографа, Сотрудник", Справочники.упКартыТахографа.ПустаяСсылка(), Справочники.упСотрудники.ПустаяСсылка());
	Результат = Справочники.упСотрудники.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упКартыТахографа.Сотрудник,
	               |	упКартыТахографа.Ссылка КАК КартаТахографа
	               |ИЗ
	               |	Справочник.упКартыТахографа КАК упКартыТахографа
	               |ГДЕ
	               |	упКартыТахографа.Код = &НомерКарты
	               |	И НЕ упКартыТахографа.ПометкаУдаления";
	Запрос.УстановитьПараметр("НомерКарты", НомерКарты);
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(сткРезультат, Выборка);
	КонецЦикла; 
	
	Возврат сткРезультат;
		
КонецФункции

#КонецОбласти

#КонецЕсли
